"{\"explanations\": {\"foodGoals_oneA\": \"Pasta chickpeas and potatoes has 625.0 Kcal. The average daily calorie intake for a woman is 2000.0 Kcal. This recipe represents the 31.25% of your daily intake.@@@@@HERE -> https://ricette.giallozafferano.it/Pasta-ceci-e-patate.html\\r\\n@@@@@HERE -> Pasta chickpeas and potatoes\\r\\n@@@@@HERE -> Basso\\r\\n@@@@@HERE -> Primi piatti\\r\\n@@@@@HERE -> https://www.giallozafferano.it/images/ricette/163/16319/foto_hd/hd650x433_wm.jpg\\r\\n@@@@@HERE -> Chickpeas and potato pasta is a first dish with simple ingredients of the peasant tradition, a dry soup, a comfort food for winter!\\r\\n@@@@@HERE -> PT10M\\r\\n@@@@@HERE -> PT30M\\r\\n@@@@@HERE -> PT40M\\r\\n@@@@@HERE -> 4\\r\\n@@@@@HERE -> 1\\r\\n@@@@@HERE -> 1\\r\\n@@@@@HERE -> 0\\r\\n@@@@@HERE -> 0\\r\\n@@@@@HERE -> 0\\r\\n@@@@@HERE -> 625.0\\r\\n@@@@@HERE -> 119.9\\r\\n@@@@@HERE -> 6.3\\r\\n@@@@@HERE -> 25.0\\r\\n@@@@@HERE -> 5.0\\r\\n@@@@@HERE -> 0.8\\r\\n@@@@@HERE -> 12.8\\r\\n@@@@@HERE -> nan\\r\\n@@@@@HERE -> 0.764\\r\\n@@@@@HERE -> [Rigati ditaloni 320g, Potatoes 500g, Dried Chickpeas 250g, Golden Onions 50g, Carrots 50g, Vegetable Broth 500g, Rosemary 2 twigs, Salt up q.b., Black pepper q.b.]\\r\\n@@@@@HERE -> [Rigated ditholons, potatoes, dried chickpeas, golden onions, carrots, vegetable broth, rosemary, salt up, Black pepper]\\r\\n@@@@@HERE -> Per preparare la pasta ceci e patate iniziate a mettere in ammollo i ceci secchi in abbondante acqua 1 per una notte. Trascorse almeno 8 ore 2, scolate i ceci 3 e teneteli da parte. A questo punto occupatevi di realizzare il brodo vegetale.\\r\\nUna volta pronto il brodo, mantenetelo in caldo, quindi pelate le patate 4, tagliatele a cubetti di circa 1 cm 5 e tenetele da parte mentre vi occupate di realizzare il soffritto. Pelate la carota, mondate la cipolla ed inseritele all'interno di un mixer 6.\\r\\nAzionate le lame fino a tritare il tutto finemente 7, quindi trasferite il composto in un tegame con l'olio extravergine d'oliva 8 e lasciatelo appassire a fuoco basso per una decina di minuti, aggiungendo un mestolo di brodo 9.\\r\\nUnite le patate 10, mescolate il tutto per far insaporire, versate un paio di mestoli di brodo 11 e aggiungete anche i ceci precedentementi scolati 12.\\r\\nUnite altro brodo fino a coprire 13 e portate a cottura; ci vorranno circa 25-30 minuti. A questo punto aggiungete il rosmarino tritato finemente 14, un pizzico di sale, una macinata di pepe nero e mescolate per amalgamare i sapori 15.\\r\\nNel frattempo cuocete la pasta in abbondante acqua bollente, salata secondo il vostro gusto 16, scolatela al dente e versatela direttamente all'interno del tegame con i ceci e le patate 17. Spegnete il fuoco e lasciate riposare per un paio di minuti prima di servire la vostra pasta ceci e patate 18.\\r\\n@@@@@HERE -> 5.0\\r\\n@@@@@HERE -> 14.0\\r\\n@@@@@HERE -> 3.9\\r\\n\"}}"
